src/config/Documents/ПланированиеДвиженийДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПланированиеДвиженийДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КонтрольПланируемыхРасходовДС</xr:Item>
				<xr:Item>AccumulationRegister.ПланируемыеДвиженияДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПланированияДвиженийДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный_</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласовано</Name>
					<Comment>для филиалов Марешева</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утверждено</Name>
					<Comment>утв. руководителем</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принято</Name>
					<Comment>утв. фин.дир</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Планирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неделя1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неделя2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неделя3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неделя4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Неделя5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перенести</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеБюджета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>статьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/КонтрольПланируемыхРасходовДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>КонтрольПланируемыхРасходовДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/InformationRegisters/ПланДвиженийДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ПланДвиженийДенежныхСредств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Неделя1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неделя2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неделя3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неделя4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неделя5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перенос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принят</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дебиторка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МесяцПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АктивностьЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/ВидыДвиженийПриходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийПриходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/ПланированиеДвиженийДС/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//ПервыйДень = Новый Массив(6);
	//ПоследнийДень= Новый Массив(6);
	//
	//
	//
	//ПервыйДень[1] = ПлановыйПериод ;
	//последнийДень[1] =ПервыйДень[1]+(7- ДеньНедели(Плановыйпериод))*24*60*60;
	////////////////////////////////////////////////////
	//ПервыйДень[2] = последнийДень[1]+24*60*60;
	//последнийДень[2] =ПервыйДень[2]+(7- ДеньНедели(ПервыйДень[2]))*24*60*60;
	///////////////////////////////////////////////////
	//ПервыйДень[3] = последнийДень[2]+24*60*60;
	//последнийДень[3] =ПервыйДень[3]+(7- ДеньНедели(ПервыйДень[3]))*24*60*60;
	//////////////////////////////////////////////////
	//ПервыйДень[4] = последнийДень[3]+24*60*60;
	//последнийДень[4] =ПервыйДень[4]+(7- ДеньНедели(ПервыйДень[4]))*24*60*60;
	/////////////////////////////////////////	
	//ПервыйДень[5] = последнийДень[4]+24*60*60;
	//последнийДень[5] =НачалоДня(конецМесяца(плановыйПериод));
	//

	//Движения.ПланируемыеДвиженияДС.Записывать = Истина;
	//Движения.ПланируемыеДвиженияДС.Очистить();

	//
	//
	//Для Каждого ТекСтрока Из Планирование Цикл
	//	сч=1;
	//	пока сч<6 цикл
	//		Если ТекСтрока["Неделя"+сч]<>0 Тогда	
	//			Движение = Движения.ПланируемыеДвиженияДС.Добавить();
	//			Движение.Период = Дата;
	//			Движение.ПлановаяДатаНачала = ПервыйДень[сч];
	//			Движение.ПлановаяДатаОкончания = последнийДень[сч];
	//			Если видоперации = Перечисления.ВидыОперацийПланированияДвиженийДС.Поступление тогда
	//				Движение.Подразделение = Подразделение;
	//			конецЕсли;
	//			Движение.Контрагент = ТекСтрока.Контрагент;
	//			Движение.Сумма = ТекСтрока["Неделя"+сч];
	//			Если видоперации = Перечисления.ВидыОперацийПланированияДвиженийДС.Расход тогда
	//				Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
	//				Движение.СтатьяРасхода = ТекСтрока.СтатьяРасхода;
	//			иначе	
	//				Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Приход;
	//				Движение.СтатьяРасхода = НаправлениеПродаж;
	//			конецЕсли;	
	//		конецЕсли;
	//		сч=сч+1;
	//	конецЦикла;
	//КонецЦикла;
    Движения.КонтрольПланируемыхРасходовДС.Записывать = Истина;
	Движения.КонтрольПланируемыхРасходовДС.Очистить();

	
	наборЗаписей = РегистрыСведений.ПланДвиженийДенежныхСредств.СоздатьНаборЗаписей();
	наборЗаписей.Отбор.МесяцПланирования.Установить(ПлановыйПериод);
    наборЗаписей.Отбор.ответственноеЛицо.Установить(Ответственный_);
	наборЗаписей.Отбор.Валюта.Установить(Валюта);
	наборЗаписей.Отбор.приходРасход.Установить(Перечисления.ВидыДвиженийПриходРасход.Расход);
	наборЗаписей.Прочитать();

	
	Для Каждого ТекСтрока Из НаборЗаписей Цикл
				Движение = Движения.КонтрольПланируемыхРасходовДС.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = ПлановыйПериод;
				Если ТекСтрока.Статья.ПоКонтрагентам тогда
				Движение.Контрагент = ТекСтрока.Контрагент;
			    конецЕсли;
			    Движение.Ответственный = Ответственный_;
			    Движение.ПериодПланирования = ПлановыйПериод;
				Движение.СтатьяРасхода = ТекСтрока.Статья;
				Движение.Сумма = ТекСтрока.Неделя1+ТекСтрока.Неделя2+ТекСтрока.Неделя3+ТекСтрока.Неделя4+ТекСтрока.Неделя5;
			КонецЦикла;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	наборЗаписей = РегистрыСведений.ПланДвиженийДенежныхСредств.СоздатьНаборЗаписей();
	наборЗаписей.Отбор.МесяцПланирования.Установить(ПлановыйПериод);
    наборЗаписей.Отбор.ответственноеЛицо.Установить(Ответственный_);
	наборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
    наборЗаписей.Записать();	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	наборЗаписей = РегистрыСведений.ПланДвиженийДенежныхСредств.СоздатьНаборЗаписей();
	наборЗаписей.Отбор.МесяцПланирования.Установить(ПлановыйПериод);
    наборЗаписей.Отбор.ответственноеЛицо.Установить(Ответственный_);
	наборЗаписей.Прочитать();
	Для каждого стр из НаборЗаписей Цикл
	стр.АктивностьЗаписи = Ложь;	
    конецЦикла;	
	наборЗаписей.Записать();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если пометкаУдаления тогда
	наборЗаписей = РегистрыСведений.ПланДвиженийДенежныхСредств.СоздатьНаборЗаписей();
	наборЗаписей.Отбор.МесяцПланирования.Установить(ПлановыйПериод);
    наборЗаписей.Отбор.ответственноеЛицо.Установить(Ответственный_);
	наборЗаписей.Прочитать();
	Для каждого стр из НаборЗаписей Цикл
	стр.АктивностьЗаписи = Ложь;	
    конецЦикла;	
	наборЗаписей.Записать();
	
	конецЕсли;	
КонецПроцедуры
